package com.example.myhaazzguideapp.guide;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.widget.TextView;

import com.example.myhaazzguideapp.R;

public class Details extends AppCompatActivity {

    TextView t1;
    String[] str1= {
            "১। ইহরাম বাধা ,২। উ’কুফে আ’রাফা (আরাফাতের ময়দানে অবস্থান)\n ৩। তাওয়াফুয্ যিয়ারাত",
            "(১) ‘সাফা ও মারওয়া’ পাহাড় দ্বয়ের মাঝে ৭ বার সায়ী করা।\n" +
                    "(২) অকুফে মুযদালিফায় (৯ই জিলহজ্জ) অর্থাৎ সুবহে সাদিক থেকে সুর্যদয় পর্যন্ত একমুহুর্তের জন্য\n" +
                    "হলেও অবস্থান করা।\n" +
                    "(৩) মিনায় তিন শয়তান (জামারাত) সমূহকে পাথর নিপে করা।\n" +
                    "(৪) ‘হজ্জে তামাত্তু’ ও ‘কি্বরান’ কারীগণ ‘হজ্জ’ সমাপনের জন্য দমে শোকর করা।\n" +
                    "(৫) এহরাম খোলার পূর্বে মাথার চুল মুন্ডানো বা ছাটা।\n" +
                    "(৬) মক্কার বাইরের লোকদের জন্য তাওয়াফে বিদা অর্থাৎ মক্কা থেকে বিদায়কালীন তাওয়াফ করা।\n" +
                    "এছাড়া আর যে সমস্ত আমল রয়েছে সব সুন্নাত অথবা মুস্তাহাব।",

            "দুইটি ফরজ: (১) ইহরাম পরিধান করা\n"+"(২) তাওয়াফ\n" +
                    "দুইটি ওয়াজিব: (১) সাফা ও মারওয়া মধ্যবর্তী (সবুজ বাতি) স্থানে সাতবার সায়ী করা\n"+" (২) মাথার চুল\n" +
                    "মুন্ডানো বা ছাটা।",

            "”লাব্বাঈক আল্লাহুম্মা লাব্বাঈক, লাব্বাঈক, লা-শারীকা-লাকা লাব্বাঈক, ইন্নাল হামদা ওয়ান্ নি’মাতা লাকা ওয়াল-মুল্ক, লা শারীকালাক।”\n" +
                    "অর্থ: আমি হাজির হে আল্লাহ! আমি উপস্থিত! আপনার ডাকে সাড়া দিতে আমি হাজির। আপনার কোন অংশীদার নেই। নিঃসন্দেহে সমস্ত প্রশংসা ও সম্পদরাজি আপনার এবং একচ্ছত্র আধিপত্য আপনার।\n" +
                    "আপনার কোন অংশীদার নেই।",


            "(১) সেলাইযুক্ত যে কোন কাপড় বা জুতা ব্যবহার, এক্ষেত্রে স্পঞ্জ সেন্ডেলের ব্যবহার করা।\n" +
                    "(২) মস্তক ও মুখমন্ডল (ইহরামের কাপড়সহ যে কোন কাপড় দ্বারা) ঢাকা,\n" +
                    "(৩) পায়ের পিঠ ঢেকে যায় এমন জুতা পরা।\n" +
                    "(৪) চুলকাটা বা ছিড়ে ফেলা,\n" +
                    "(৫) নখকাটা,\n" +
                    "(৬) ঘ্রানযুক্ত তৈল বা আতর লাগানো।\n" +
                    "(৭) স্ত্রীর সঙ্গে সংগম করা।\n" +
                    "(৮) যৌন উত্তেজনামূলক কোন আচরণ বা কোন কথা বলা।\n" +
                    "(৯) শিকার করা।\n" +
                    "(১০) ঝগড়া বিবাদ বা যুদ্ধ করা।\n" +
                    "(১১) চুল দাড়িতে চিরুনী বা আঙ্গুলী চালনা করা, যাতে ছিড়ার আশংকা থাকে।\n" +
                    "(১২) শরীরে সাবান লাগানো।\n" +
                    "(১৩) উকুন, ছারপোকা, মশা ও মাছিসহ কোন জীবজন্তু হত্যা করা বা মারা।\n" +
                    "(১৪) কোন গুনাহের কাজ করা, ইত্যাদি।",

            "প্রথম প্রকার হজ্জে ইফরাদ\n" +
                    "\n" +
                    "বর্ণনা: ওমরাহ্ ব্যতিত শুধু হজ্জের জন্য ইহরাম বাঁধা এবং হজ্জের সাথে ওমরাহকে না মিলানো। (বদলী হজ্জের জন্যও এই হজ্জ)।\n" +
                    "নিয়্যাত: আল্লাহুমা ইন্নী উরীদুল হাজ্জা ফায়াসছির হুলিওয়াতা কাব্বালহুমিনি্ন। (বাংলা নিয়ত- আল্লাহ আমি ইফরাদ হজ্জের উদ্দেশ্যে আপনার সন্তুষ্টির জন্য ইহরাম বাধলাম। তা সহজ করে দিন ও কবুল করে নিন)।",
    };
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_details);

    t1=findViewById(R.id.textView_id);
        Intent i = getIntent();
        String s = i.getStringExtra("pos");//t1.setText(s);
        int position=Integer.parseInt(s);

        if(position==0){
            t1.setText(str1[0]);
        }else  if(position==1){
            t1.setText(str1[1]);
        }
        else  if(position==2){
            t1.setText(str1[2]);
        }
        else  if(position==3){
            t1.setText(str1[3]);
        }
        else  if(position==4){
            t1.setText(str1[4]);
        }
        else  if(position==5){
            t1.setText(str1[5]);
        }

        }
    }

