package com.example.myhaazzguideapp.guide;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.widget.TextView;

import com.example.myhaazzguideapp.R;

public class Details extends AppCompatActivity {

    TextView t1, t2;
    String[] str_title = {
            "প্রাক নিবন্ধন ",
            "নিবন্ধন",
            "রেজিস্ট্রেশন প্রক্রিয়া",
            "হজের প্রস্তুতি:\n",
            "হজযাত্রীদের বাংলাদেশ পর্বে করণীয় : \n",
            "আশকোনা হজ ক্যাম্প/বিমান বন্দর এবং বিমানে করণীয়:\n",
            "বিমান থেকে নামার পর করণীয় \n",
            "মক্কায় পৌঁছর পর করণীয়\n",
            "হজের সময় করণীয়\n",
            "মদিনায় গমন ও করণীয়\n",
            "দেশে ফেরার সময় করণীয়\n",


            "সফরের দো'আ",
            "হজ-উমরার বিধি-নিষেধ জানা অবশ্য কর্তব্য কেন?",
            "হজ:",
            "উমরা:",
            "হজ ও উমরার ফযীলত\n",
            "হজের প্রকারভেদ",
            " ১. তামাত্তু হজ\n",
            " ২. কিরান হজ\n",
            " ৩. ইফরাদ হজ",
            " হজযাত্রীদের করনীয়",
            " হজ এজেন্সির করনীয়",
            " হজ গাইডের করনীয় ",


            " হজযাত্রীদের স্বাস্থ্য সেবা কার্যক্রম",
            " হজযাত্রীদের স্বাস্থ্য সেবা কার্যক্রম তার কয়েকটি উল্লেখ",
            " হাজযাত্রীদের সুস্বাস্থ্য ও নিরাপত্তা রক্ষায় করণীয়",


    };
    String[] str1 = {
            "হজে গমনের প্রথম পদক্ষেপ হল প্রাক-নিবন্ধন করা যা দুইভাবে করা যায়:  \n" +
                    "ক) সরকারি ব্যবস্থাপনায়\n" +
                    "খ) বেসরকারি ব্যবস্থাপনায় (অনুমোদিত এজেন্সির মাধ্যমে)\n",


            " ধর্ম বিষয়ক মন্ত্রণালয় কর্তৃক হজ প্যাকেজ ঘোষণার পরে আপনি ঐ বছরের হজে যাবার নির্ধারিত ক্রমিক/সিরিয়ালের মধ্যে থাকলে প্যাকেজ অনুযায়ী ব্যাংকে টাকা জমা প্রদান এবং পাসপোর্টের তথ্য দিয়ে নিবন্ধন সম্পন্ন করতে পারবেন। এ সময় ব্যাংক থেকে আপনি নিবন্ধন সনদ সংগ্রহ করবেন এবং আপনার মোবাইলে নিবন্ধন হবার একটি SMS পাবেন। \n",


            "",

            "যথাসময়ে আপনার পিআইডি নম্বর জেনে নিন। হজ সংক্রান্ত সকল লেনদেন সরাসরি এজেন্সির সঙ্গে করুন।\n" +
                    "যথাসময়ে সরকার নির্ধারিত হাসপাতাল/ স্বাস্থ্য কেন্দ্র থেকে টিকা গ্রহণ করে মেডিকেল সার্টিফিকেট গ্রহণ করুন। ডায়াবেটিকস, হার্ট বা ক্রণিক রোগীরা প্রেসকিপসনসহ অবশ্যই ৫০ দিনের ঔষধ সঙ্গে রাখুন।\n" +
                    "আপনার ফ্লাইট সিডিউল এবং সৌদি আরবে যে হোটেল/বাড়িতে থাকবেন তার ঠিকানা জেনে নিন। পাসপোর্টের পিছনে অবশ্যই হোটেল/বাড়ির ঠিকানা লেখা থাকতে হবে।\n" +
                    "টিকেট, পাসপোর্ট,  হজ গমণের অনুমতিপত্র, টাকা জমা দেওয়ার ডুপ্লিকেট রসিদ, মেডিকেল সার্টিফিকেট ও অন্যান্য জরুরি কাগজপত্র সংগ্রহ করে ২সেট ফটো কপি করে রাখুন অথবা ই-মেইলে সংরক্ষণ করুন।\n" +
                    "আনুমানিক ৫০,০০০ টাকার সমপরিমান বৈদেশিক মুদ্রা সঙ্গে রাখুন।\n\n\n\n\n\n" +
                    "প্রয়োজনীয় মালামাল বহন করার মত ২৩ কেজি ধারণক্ষমতাসম্পন্ন দুইটি মাঝারি লাগেজ এবং একটি ছোট হাতব্যাগ সাত কেজি সঙ্গে নেয়া যাবে। লাগেজ ও ব্যাগের উপর নাম-ঠিকানা, পাসপোর্ট নম্বর এবং মোবাইল নম্বর  লিখতে হবে।\n" +
                    "ঔষধের প্রেসকিপসন, ঔষধ,  জরুরি কাগজপত্র এবং জরুরি প্রয়োজনে ব্যবহারের জন্য এক সেট কাপড় ছোট ব্যাগে রাখুন। \n" +
                    "পুরুষ হজযাত্রীদের জন্য কমপক্ষে ২সেট ইহরামের কাপড়, ২সেট পায়জামা-পাঞ্জাবি, ২টি লুঙ্গি, ২টি টুপি, ৪টি গেঞ্জি, ২জোড়া স্যান্ডেল, ২টি তোয়ালে/গামছা, ১টি খাবার প্লেট, ১টি পানির গ্লাস, ১ টি ছাতা, চিকিৎকের পরামর্শ অনুযায়ী প্রয়োজনীয় ঔষধ, ২টি রিডিং চশমা, একটি ছোট কাঁচি, টুথ ব্রাশ, পেস্ট, নাইলনের রসি, মহিলা হজ যাত্রীদের জন্য প্রয়োজনীয় সংখ্যক সালোয়ার-কামিজ, ওড়না, বোরকা এবং অন্যান্য ব্যবহার্য কাপড় সঙ্গে নিতে পারেন ।\n",


            " হজে যাওয়ার পূর্বে ধর্ম বিষয়ক মন্ত্রণালয় থেকে প্রদত্ত পিআইডি কার্ড এবং কবজি বেল্ট সংগ্রহ করুন এবং গলায় ঝুলিয়ে রাখুন; এগুলো সবসময় সঙ্গে রাখতে হবে।\n" +
                    "ঢাকা হযরত শাহ জালাল (র:) বিমান বন্দর দিয়ে যারা হজে যাবেন তাদেরকে হজ যাত্রার তারিখের তিন দিন আগে হজযাত্রীদের আশকোনা হজ ক্যাম্পে আসতে হবে। হজ ক্যাম্পে নিজ খরচে খাওয়া দাওয়া করতে হবে।\n" +
                    "ধর্ম বিষয়ক মন্ত্রণালয় কর্তৃক প্রকাশিত হজ, ওমরাহ ও যিয়ারাত সম্পর্কিত বই অথবা অন্য কোন একটি নির্দেশিকা সঙ্গে রাখুন।\n" +
                    "আপনার হজ গাইডের নাম/ এজেন্সি মালিকের নাম/বাংলাদেশ হজ অফিসের নিয়ন্ত্রণকক্ষের ফোন নম্বর জেনে নিন এবং তাঁর সঙ্গে বিমানে উঠার আগেই আপনার হজ গাইডের যোগাযোগ করুন। \n",


            " যে সকল হজযাত্রী সরাসরি মক্কায় গমণ করবেন তাঁরা যাত্রার ৬ ঘন্টা পূর্বে ইহরামের কাপড় পরবেন। যারা সরাসরি মদিনা শরিফ যাবেন তাদেরকে ঢাকা হযরত শাহ জালাল(র:)বিমান বন্দর ইহরাম পরতে হবে না।\n" +
                    "বিমানে ভ্রমণকালে ছুরি, কাঁচি, সুঁই, নেইল কার্টার, লাইটার, পেস্ট, স্প্রে,ধারালো  এবং তরল জাতীয় জিনিস হাত ব্যাগে নেওয়া যাবেনা। \n" +
                    "বিমানে ভ্রমণের সময় চাল, ডাল, শুটকি,রান্না করা খাবার, ফল মূল, তরিতরকারি বহণ করা যাবে না।\n" +
                    "বিমানে ওজু করা যায় না। তায়াম্মুম করার জন্য বিমান ক্রু/এয়ার হোস্টেজের সহায়তায় গ্রহণ করুন। প্রয়োজনে একটি ছোট আকারে তায়াম্মুম সঙ্গে নিবেন।\n" +
                    "কোন অবস্থাতেই বিমানে ধুমপান করা যাবে না। \n" +
                    "যে সকল হজযাত্রীর সৌদি আরবের Pre-arrival Immigration বাংলাদেশে সম্পন্ন হবে, তারা বিমানবন্দরের নির্দিষ্ট স্থানে Immigration সম্পন্ন করবেন। এক্ষেত্রে কিছু সময়ের প্রয়োজন হতে পারে। তাই অনুগ্রহপূর্বক ধৈর্য সহকারে অপেক্ষা করুন।\n",


            " যে সকল হজযাত্রীর Pre-arrival Immigration বাংলাদেশে সম্পন্ন হয়নি তাদের সৌদি আরবে টার্মিনালে পৌঁছানোর পর Waiting রুমে অপেক্ষা করতে হবে। এর পর Immigration Point এ উপস্থিত হয়ে পাসপোর্ট দেখাতে হবে। Immigration Point এ আপনার ছবি এবং হাতের আঙ্গুলের ছাপ নেওয়া হবে। আপনার পাসপোর্টে সিল দেওয়া হয়েছে কিনা দেখে নিন। Immigration Point এ একটু সময় লাগে তাই ধৈর্য ধরে অপেক্ষা করুন।\n" +
                    "যে সকল হজযাত্রীর Pre-arrival Immigration বাংলাদেশে সম্পন্ন হয়েছে তাদের সৌদি আরবে Immigration করতে হবে না।\n" +
                    "বাসে উঠার পূর্বে মুয়াল্লিমের পক্ষে বাস পরিচালনা কর্তৃপক্ষ পাসপোর্ট বুঝে নিবে। এ সময় টিকিট/বোর্ডিং পাস নিজের কাছে সংরক্ষণ করুন। জমাকৃত পাসপোর্ট হজ্ব শেষে ফেরার সময় বিমানবন্দরে ফেরত প্রদান করা হবে।\n" +
                    "সৌদি আরবে রাস্তা পারাপারের সময় দৌড় দিবেন না। ডান বাম দেখে রাস্তা পার হবেন। সৌদি আরবে গাড়ি ডান দিক থেকে চলে।\n" +
                    "মক্কায় নির্ধারিত বাড়ী/হোটেলে পৌছার পর বাস থেকে নেমে নিজের লাগেজ বুঝে নিয়ে হোটেলের নিজ কক্ষ নম্বর জেনে নিয়ে নির্ধারিত কক্ষে অবস্থান করতে হবে। লিখিত অনুমতি ছাড়া কোন আত্মীয়-স্বজনের বাড়িতে থাকা যাবে না। \n" +
                    "হোটেল/বাড়িতে কোন অবস্থাতেই রান্না এবং কাপড় ইস্ত্রি করা যাবে না। রান্নায় আগুনের ঝুকি থাকে। এতে আপনার এবং অন্যান্য হাজীর বড় ধরনের ক্ষতি হতে পারে। কাপড় ঝুলানোর জন্য রশি নিয়ে যেতে পারেন।\n" +
                    "মক্কা-মদিনায় হোটেল/বাড়িতে প্রতিরুমে ৪/৫ জন করে থাকতে হবে। পুরুষ এবং মহিলা পৃথক রুম থাকতে হবে। সিঙ্গেল খাটের আয়তন সাধারণ মাপের চেয়ে ছোট হবে। রুমগুলোও বেশি বড় হবে না। অপরিচিত হাজীর সঙ্গে একই রুমে থাকার মানসিকতা থাকতে হবে।\n" +
                    "প্রচুর পানি/ফলের রস পান করবেন। ডাস্টবিন ছাড়া অন্য কোথাও ময়লা-আবর্জনা ফেলবেন না।\n" +
                    "কখনো পথ হারিয়ে গেলে ভয় না পেয়ে আপনার গাইড/ হজ অফিসের নিয়ন্ত্রণকক্ষে/ অথবা সৌদি মোয়াল্লেমের নম্বরে ফোন করুণ। আপনার আশে পাশেই হজ কর্মী/ প্রবাসী বাংলাদেশি/ পুলিশের  সহায়তা নিতে হবে।\n" +
                    "অসুস্থ অনুভব করলে এজেন্সি/গাইডের সহায়তায় বাংলাদেশ মেডিক্যাল ক্লিনিকে গিয়ে সেবা গ্রহণ করতে পারবেন। বাংলাদেশ মেডিক্যাল ক্লিনিক থেকে বিনামূল্যে ঔষধসহ প্রাথমিক চিকিৎসা সেবা প্রদান করা হয়।\n" +
                    "সৌদি আরবে অবস্থানকালে কোন প্রকার রাজনৈতিক আলোচনা/মতবাদ প্রচার থেকে বিরত থাকুন",


            " মক্কায় নির্ধারিত বাড়ী/হোটেলে পৌছার পর বাস থেকে নেমে নিজের লাগেজ বুঝে নিয়ে হোটেলের নিজ কক্ষ নম্বর জেনে নিয়ে নির্ধারিত কক্ষে অবস্থান করতে হবে। লিখিত অনুমতি ছাড়া কোন আত্মীয়-স্বজনের বাড়িতে থাকা যাবে না। \n" +
                    "হোটেল/বাড়িতে কোন অবস্থাতেই রান্না এবং কাপড় ইস্ত্রি করা যাবে না। রান্নায় আগুনের ঝুকি থাকে। এতে আপনার এবং অন্যান্য হাজীর বড় ধরনের ক্ষতি হতে পারে। কাপড় ঝুলানোর জন্য রশি নিয়ে যেতে পারেন।\n" +
                    "মক্কা-মদিনায় হোটেল/বাড়িতে প্রতিরুমে ৪/৫ জন করে থাকতে হবে। পুরুষ এবং মহিলা পৃথক রুম থাকতে হবে। সিঙ্গেল খাটের আয়তন সাধারণ মাপের চেয়ে ছোট হবে। রুমগুলোও বেশি বড় হবে না। অপরিচিত হাজীর সঙ্গে একই রুমে থাকার মানসিকতা থাকতে হবে।\n"+"মর্যাদা/পদ/পদবি/সামাজিক অবস্থান বিবেচনায় কোন রুম বরাদ্দ দেওয়া হবে না। সকলে মিলে মিশে থাকতে হবে। \n" +
                    " মক্কা-মদিনায় হোটেল/বাড়িতে গোসলখানার পানি সবসময় গরম থাকে। পানি গায়ে ঢালার আগে তাপমাত্রা দেখে নিতে হবে। বালতিতে সবসময় পানি রাখবেন।\n" +
                    "তাওয়াফ/সায়ী এবং শয়তানকে পাথর মারার সময় বেশি টাকা পয়সা (রিয়াল) সঙ্গে নিবেন না।\n" +
                    "ট্যাক্সি ভাড়া প্রদানের জন্য খুচরা টাকা (রিয়াল) সঙ্গে রাখতে হবে। যতদূর সম্ভব একা ট্যাক্সিতে উঠবেন না। কিছু ট্যাক্সি চালক প্রলোভন দেখিয়ে গাড়িতে ঊঠায়। এর পর পর ছিনতাই করে, তাই সাবধানে চলা ফেরা করতে হবে।\n" +
                    "সবসময় পরিস্কার পরিচ্ছন্ন থাকতে হবে। খালি পায়ে হাঁটা যাবেনা। এতে পায়ে পোসকা পরতে পারে। রৌদ্রে ছাতা ব্যবহার করুন।\n"+
                    "প্রচুর পানি/ফলের রস পান করবেন। ডাস্টবিন ছাড়া অন্য কোথাও ময়লা-আবর্জনা ফেলবেন না।\n" +
                    "কখনো পথ হারিয়ে গেলে ভয় না পেয়ে আপনার গাইড/ হজ অফিসের নিয়ন্ত্রণকক্ষে/ অথবা সৌদি মোয়াল্লেমের নম্বরে ফোন করুণ। আপনার আশে পাশেই হজ কর্মী/ প্রবাসী বাংলাদেশি/ পুলিশের  সহায়তা নিতে হবে।\n" +
                    "অসুস্থ অনুভব করলে এজেন্সি/গাইডের সহায়তায় বাংলাদেশ মেডিক্যাল ক্লিনিকে গিয়ে সেবা গ্রহণ করতে পারবেন। বাংলাদেশ মেডিক্যাল ক্লিনিক থেকে বিনামূল্যে ঔষধসহ প্রাথমিক চিকিৎসা সেবা প্রদান করা হয়।\n" +
                    "সৌদি আরবে অবস্থানকালে কোন প্রকার রাজনৈতিক আলোচনা/মতবাদ প্রচার থেকে বিরত থাকুন।\n",


            "জিলহজ মাসের ৭ তারিখ রাতে অথবা ৮ তারিখ সকাল থেকে দুপুরের মধ্যে মোয়াল্লেমের বাসে মিনা যেতে হবে। সাথে হালকা কাপড়-চোপড় ও প্রয়োজনীয় টাকা পয়সা (রিয়াল) নিবেন। বাসে সকলের বসার জায়গা হয় না। তাই মহিলা ও বয়স্কদের আগে উঠতে দিতে হবে। মহিলা এবং তার মাহরামকে একই গাড়িতে উঠতে হবে।\n" +
                    "** মিনা যাওয়ার সময় সকলে একত্রে হোটেলের নিচে নামবেন না। গাইড এবং হজ কর্মীরা ডাকার পর নামতে হবে। না হয় অপেক্ষা করতে কষ্ট হবে। \n" +
                    "**মক্কা হতে পায়ে হেটে মিনা আরাফাতে যাওয়া থেকে বিরত থাকবেন। কারণ এতে অসুস্থ হয়ে পড়তে পারেন।\n" +
                    "** শয়তানকে পাথর নিক্ষেপ করার সময় দলবদ্ধভাবে যাবেন। পাথর মারার সময় কখনো স্যান্ডেল খুলে গেলে, পাথর হাত থেকে পড়ে গেলে কোন অবস্থাতে উঠানোর চেষ্টা করবেন না। কিছু অতিরিক্ত পাথর রাখবেন। অক্ষম, বৃদ্ধ ও অসুস্থদের পক্ষে অন্যের দ্বারা পাথর নিক্ষেপ করানো যায়।\n" +
                    "** মিনা-আরাফাতে নিজের তাবু হারিয়ে গেলে হজ অফিসের তাবুতে যাওয়ার চেষ্টা করবেন। এ জন্য মিনা-আরাফাতের  ম্যাপ সঙ্গে রাখুন এবং হজ অফিসের নিয়ন্ত্রণ কক্ষের ফোন নম্বর জেনে রাখুন।\n" +
                    "** মিনা আপনার তাবুর এলাকার নম্বর/নিকটস্থ খুটি নম্বর এবং রাস্তার নম্বর জেনে রাখতে হবে। পথ হারিয়ে গেলে এই  নম্বর ধরে তাবু খুজতে হবে।\n" +
                    "**আরফা থেকে ফেরার পথে কোন কারণে আপনার গাড়ি খুঁজে না পেলে বাংলাদেশের অন্য যে কোন গাড়িতে করে মুজদাফা/মিনায় চলে আসতে হবে।\n" +
                    "**মিনা-আরাফাতে অবস্থানকালে পরিমিত খাবার গ্রহণ করতে হবে। অতিরিক্ত মসলাযুক্ত খাবার পরিহার করুন। সবসময় পানির বোতল সঙ্গে রাখুন। ডায়াবেটিকস রোগীরা সবসময় কিছু খাবার সঙ্গে রাখবেন।\n" +
                    "**মিনা-আরাফাতে অবস্থানকালে ধুমপান ও আগুন জালানো থেকে বিরত থাকুন।\n" +
                    "**মোজদালেফায় অবস্থানের জন্য বাস থেকে নামার পর পুনরায় কখন, কোন জায়গা থেকে বাসে উঠবেন জেনে নিন। মোজদালেফায় দলবদ্ধভাবে অবস্থান করুন।\n" +
                    "**মিনা থেকে যাঁরা ট্রেনে যাবেন তাদেরকে ট্রেনের টিকিট হাতের কবজিতে লাগিয়ে রাখতে হবে।\n" +
                    "**মিনা থেকে মক্কা যাওয়ার সময় দলবদ্ধভাবে যেতে হবে। \n" +
                    "**নিজে কুরবানি দেওয়া কষ্টসাধ্য। কুরবানির টাকা ইসলামী উন্নয়ন ব্যাংকে জমা দেওয়াই সৌদি সরকার কর্তৃক স্বীকৃত ব্যবস্থা। অন্যথা প্রতারিত হওয়ার সম্ভাবনা থাকবে।\n",


            " পুরুষ হজযাত্রীদের জন্য কমপক্ষে ১ সেট ইহরামের কাপড়, ২সেট পায়জামা-পাঞ্জাবি, ২টি লুঙ্গি, ২টি টুপি, ৪টি গেঞ্জি, ১জোড়া স্যান্ডেল, ১টি তোয়ালে/গামছা, ১টি খাবার প্লেট, ১টি পানির গ্লাস, চিকিৎকের পরামর্শ অনুযায়ী প্রয়োজনীয় ঔষধ, ২টি রিডিং চশমা, একটি ছোট কাঁচি, টুথ ব্রাশ, পেস্ট, নাইলনের রসি, মহিলা হজ যাত্রীদের জন্য প্রয়োজনীয় সংখ্যক সালোয়ার-কামিজ, ওড়না, বোরকা এবং অন্যান্য ব্যবহার্য কাপড় সঙ্গে নিতে পারেন।\n" +
                    " ** উল্লিখিত মালামাল বহনের জন্য একটি ছোট ব্যাগ নিতে হবে।\n" +
                    " ** যারা মদিনা থেকে দেশে ফিরবেন তাদেরকে দেশে ফেরার সময় ৩৬ ঘন্টা পূর্বে লাগেজ গুছিয়ে নিতে হবে। টিকেট ও বোর্ডিং পাশ সাথে রাখতে হবে।\n" +
                    " ** গাইডের পরামর্শক্রমে ঐতিহাসিক স্থানসমূহ পরিদর্শন করা যেতে পারে।\n" +
                    " ** অসুস্থ অনুভব করলে এজেন্সি/গাইডের সহায়তায় বাংলাদেশ মেডিক্যাল ক্লিনিকে গিয়ে সেবা গ্রহণ করতে পারবেন। বাংলাদেশ মেডিক্যাল ক্লিনিক থেকে বিনামূল্যে ঔষধসহ প্রাথমিক চিকিৎসা সেবা প্রদান করা হয়।\n" +
                    " ** মদিনা থেকে মক্কায় ফেরার পথে ইহরাম পরে আসতে হবে\n" +
                    " ** কোন আত্মীয় স্বজন, বন্ধু-বান্ধব বা অন্য কারও মালামাল পরিবহন করতে গিয়ে নিজেকে বিপদে ফেলবেন না। অতিরিক্ত ওজনের ক্ষেত্রে প্রতি কেজির জন্য ৬০ রিয়াল (প্রায় ১৪০০ টাকা)  করে পরিশোধ করতে হবে।\n" +
                    " ** হজ সংক্রান্ত যে কোন জরুরি প্রয়োজনে ঢাকা/মক্কা/মদিনা/জেদ্দা হজ অফিসে যোগাযোগ করুন। আপনার যে কোন পরামর্শ/সমস্যা www.mora.gov.bd এর Facebook এর মাধ্যমে শেয়ার  করতে পারেন। হজযাত্রীদের যাবতীয় তথ্য www.hajj.gov.bd থেকেও জানা যাবে।\n" +
                    " ** আপনার স্মার্ট মোবাইলে ‘হজ গাইড’ এ্যাপস ডাউনলোড করে হজ সংক্রান্ত সব তথ্য জানতে পারবেন।\n",

            " দেশে ফেরার সময় ৩৬ ঘন্টা পূর্বে লাগেজ গুছিয়ে নিতে হবে। টিকেট ও বোর্ডিং পাশ সাথে রাখতে হবে।\n" +
                    " ফেরার সময় বড় লাগেজ পৃথক গাড়িতে নেওয়া হবে। ছোট লাগেজটি সঙ্গে রাখতে পারেন। বাংলাদেশ বিমানে দুই ব্যাগে ৪৬ কেজি মালামাল আনা যাবে। কোন ব্যাগের ওজন ৩০ কেজির বেশি হবে না।\n" +
                    "জমজমের পানি লাগেজে আনবেন না। ফেরার পথে ঢাকা বিমান বন্দর থেকে জমজমের পানি দেওয়া হবে।\n" +
                    "হাতে কিছু  নগদ অর্থ রাখতে হবে। এয়ারপোর্টে থেকে যাতে বাড়ী/বাসায় পৌছানো যায়। \n" +
                    "কোন কারণে ফ্লাইট বিলম্ব হলে, মানসিক প্রস্তুতি থাকতে হবে ধৈর্য্য রাখার।\n" +
                    "নিষিদ্ধ জিনিস বহন করবেন না। বিমানে ভ্রমণকালে ছুরি, কাঁচি, সুঁই, নেইল কার্টার, লাইটার, পেস্ট, স্প্রে,ধারালো  এবং তরল জাতীয় জিনিস হাত ব্যাগে নেওয়া যাবেনা। \n",


            " আবদুল্লাহ ইবন উমার রাদিয়াল্লাহু আনহুমা থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সফরের উদ্দেশ্যে উটের পিঠে আরোহণ করতেন, তখন বলতেন,\n" +
                    "\n" +
                    " \n" +
                    "\n" +
                    "(আল্লাহু আকবার, আল্লাহু আকবার, আল্লাহু আকবার। সুবহানাল্লাধী সাখ্খারা লানা হাযা ওয়ামা কুন্না লাহু মুকরিনীন; ওয়া ইন্না ইলা রবিবনা লামুনকালিবৃন। আল্লাহুম্মা ইন্না নাসআলুকা ফি সাফারিনা হাযাল-বিরা ওয়াত-তাকওয়া, ওয়া মিনাল আমালি মা-তারদা। আল্লাহুম্মা হাওয়িন 'আলাইনা সাফারানা হাযা ওয়াতবি 'আন্না বু'দাহু। আল্লাহুম্মা আনতাস-সাহেবু ফিস-সাফারি, ওয়াল খালীফাতু ফিল আহলি। আল্লাহুম্মা ইন্নী আউযুবিকা মিন ওয়াশছাইস সাফারি ওয়া কাআবাতিল মানযারি ওয়া সুইল-মুনকালাবি ফিল মালি ওয়াল আহলি।)\n" +
                    "“আল্লাহ মহান। আল্লাহ মহান। আল্লাহ মহান। পবিত্র সেই মহান সত্তা, যিনি আমাদের জন্য একে বশীভূত করেছেন, যদিও আমরা একে বশীভূত করতে সক্ষম ছিলাম না। আর আমরা অবশ্যই ফিরে যাব আমাদের রবের নিকট । হে আল্লাহ, আমাদের এ সফরে আমরা আপনার নিকট প্রার্থনা করি সৎকাজ ও তাকওয়ার এবং এমন আমলের যাতে আপনি সন্তুষ্ট হন। হে আল্লাহ, আমাদের জন্য এ সফর সহজ করুন এবং এর দূরত্ব কমিয়ে দিন। হে আল্লাহ, এ সফরে আপনিই আমাদের সাথী এবং পরিবার-পরিজনের আপনিই তত্ত্বাবধানকারী। হে আল্লাহ, আমরা আপনার আশ্রয় প্রার্থনা করছি সফরের কষ্ট ও অবাঞ্ছিত দৃশ্য থেকে এবং সম্পদ ও পরিজনের মধ্যে মন্দ প্রত্যাবর্তন থেকে।”\n" +
                    "আর সফর থেকে ফিরেও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উপরোক্ত দো'আগুলো পড়তেন এবং সাথে এ অংশটি যোগ করতেন:\n" +
                    "\n" +
                    "(আয়েবৃনা, তায়েবৃনা, আবেদুনা, লি রাবিবনা হামিদুন)।\n" +
                    "“আমরা আমাদের রবের উদ্দেশ্যে প্রত্যাবর্তনকারী, তওবাকারী, ইবাদতকারী ও আমাদের রবের প্রশংসাকারী।”! \n",


            " প্রত্যেক মুসলিমের ওপর ইসলামী জ্ঞান অর্জন করা ফরয। আর জন্য ব্যবসা সংক্রান্ত ইসলামী বিধি-বিধান জানা ফরয। কৃষকের জন্য কৃষি সংক্রান্ত ইসলামের যাবতীয় নির্দেশনা জানা ফরয। তেমনি ইবাদতের ক্ষেত্রেও সালাত কায়েমকারির জন্য সালাতের যাবতীয় মাসআলা জানা ফরয। হজ পালনকারীর জন্য হজ সংক্রান্ত যাবতীয় মাসআলা জানা ফরয।\n" +
                    "প্রচুর অর্থ ব্যয় ও শারীরিক কষ্ট সহ্য করে হজ থেকে ফেরার পর যদি আলেমের কাছে গিয়ে বলতে হয়, “আমি এই ভুল করেছি, দেখুন তো কোন পথ করা যায় কি-না” তবে তা দুঃখজনক বৈ কি। অথচ তার ওপর ফরয ছিল, হজের সফরের পূর্বেই এ সম্পর্কে সঠিক জ্ঞান অর্জন করা। ইমাম বুখারী রহ. তাঁর রচিত সহীহ গ্রন্থের একটি পরিচ্ছেদ-শিরোনাম করেছেন এভাবে:\n" +
                    "\n" +
                    "(এ অধ্যায় “কথা ও কাজের আগে জ্ঞান লাভ করার বিষয়ে\" । কারণ, আল্লাহ তা'আলা বলেন, “সুতরাং তুমি “জেনে রাখো” যে, তিনি ছাড়া কোনো ইলাহ নেই)। ইমাম বুখারী রহ. এখানে কথা ও কাজের আগে ইলম তথা জ্ঞানকেই অগ্রাধিকার দিয়েছেন। তাছাড়া রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে সহীহ হাদীসে বর্ণিত হয়েছে:\n" +
                    "\n" +
                    "\n" +
                    "“তোমরা আমার কাছ থেকে তোমাদের হজ ও উমরার বিধি-বিধান শিখে নাও।” এ হাদীস থেকে প্রমাণিত হয়, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে হজ ও উমরা পালনের আগেই হজ সংক্রান্ত যাবতীয় আহকাম সম্পর্কে জ্ঞান লাভ করার নির্দেশ দিয়েছেন।\n" +
                    "অতএব, আমরা নিঃসন্দেহে বলতে পারি, হজ-উমরা পালনকারী প্রত্যেক নর-নারীর জন্য যথাযথভাবে হজ ও উমরার বিষয়াদি জানা ফরয। হজ ও উমরা পালনের বিধি-বিধান জানার পাশাপাশি প্রত্যেক হজ ও উমরাকারিকে অতি গুরুত্বের সাথে হজ ও উমরার শিক্ষণীয় দিকগুলো অধ্যয়ন ও অনুধাবন করতে হবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হজের সফরে বা হজের দিনগুলোতে কিভাবে আল্লাহর সাথে সম্পর্ক নিবিড় করার চেষ্টায় লিপ্ত ছিলেন, উম্মত ও পরিবার-পরিজন এবং স্বজনদের সাথে উঠাবসায় কী ধরনের আচার- আচরণ করেছেন তা রপ্ত করতে হবে। নিঃসন্দেহে এ বিষয়টির অধ্যয়ন, অনুধাবন ও রপ্তকরণ হজ-উমরার তাৎপর্য ও উদ্দেশ্য সম্পর্কে চেতনা সৃষ্টি করবে।\n" +
                    "আল্লাহ তা'আলা আমাদের সকলকে সঠিকভাবে হজ-উমরার বিধি-বিধান জানা, এর শিক্ষণীয় দিকগুলো অনুধাবন করা এবং সহীহভাবে হজ-উমরা পালন করার তাওফীক দান করুন। আমীন।\n",


            "হজের আভিধানিক অর্থ ইচ্ছা করা। শরী'আতের পরিভাষায় হজ অর্থ নির্দিষ্ট সময়ে, নির্দিষ্ট কিছু জায়গায়, নির্দিষ্ট ব্যক্তি কর্তৃক নির্দিষ্ট কিছু কর্ম সম্পাদন করা।\n",


            "উমরার আভিধানিক অর্থ: যিয়ারত করা। শরী\n" + "আতের পরিভাষায় উমরা অর্থ, নির্দিষ্ট কিছু কর্ম অর্থাৎ ইহরাম, তাওয়াফ, সা“ঈ ও মাথা মুণ্তন বা চুল ছোট করার মাধ্যমে বায়তুল্লাহ শরীফের যিয়ারত করা ।\n",


            " হজ ও উমরার ফযীলত সম্পর্কে অনেক হাদীস রয়েছে। নিম্নে তার কয়েকটি উল্লেখ করা হলো:\n" +
                    "১. হজ অন্যতম শ্রেষ্ঠ আমল । আবু হুরায়রা রাদিয়াল্লাহু আনহু থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করা হলো, কোন আমলটি সর্বোত্তম? তখন তিনি বললেন:\n" +
                    "\n" +
                    "“আল্লাহ ও তাঁর রাসূলের প্রতি ঈমান আনা। বলা হলো, “তারপর কী”? তিনি বললেন, 'আল্লাহর পথে জিহাদ করা”। বলা হলো “তারপর কোনটি? তিনি বললেন, “কবুল হজ'।” অন্য হাদীসে বর্ণিত হয়েছে, সর্বোত্তম আমল কী- এ ব্যাপারে এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলেন । উত্তরে তিনি বললেন,\n" +
                    "\n" +
                    "“এক আল্লাহর প্রতি ঈমান, অতঃপর মাবরূর হজ, যা সকল আমল থেকে শ্রেষ্ঠ; সূর্য উদয় ও অস্তের মধ্যে যে পার্থক্য ঠিক তারই মত (অন্যান্য আমলের সাথে তার শ্রেষ্ঠত্বের পার্থক্য)।”\n" +
                    " \n" +
                    "২. পাপমুক্ত হজের প্রতিদান জান্নাত। আবু হুরায়রা রাদিয়াল্লাহু আনহু থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“আর মাবরূর হজের প্রতিদান জান্নাত ভিন্ন অন্য কিছু নয়” \n" +
                    "৩. রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হজকে জিহাদ হিসেবে গণ্য করেছেন। আয়েশা রাদিয়াল্লাহু আনহা থেকে বর্ণিত, তিনি বলেন, \n" +
                    "‘হে আল্লাহর রাসূল, জিহাদকে তো সর্বোত্তম আমল হিসেবে মনে করা হয়, আমরা কি জিহাদ করবো না? তিনি বললেন,\n" +
                    "\n" +
                    "\n" +
                    "“তোমাদের জন্য সর্বোত্তম জিহাদ হচ্ছে মাবরূর হজ।”? অন্য হাদীসে বর্ণিত হয়েছে আয়েশা রাদিয়াল্লাহু আনহা বলেন, ‘ইয়া রাসুল্লাল্লাহ, আমরা কি আপনাদের সাথে জিহাদে ও অভিযানে যাব না”? তিনি বললেন,\n" +
                    "\n" +
                    "“তোমাদের জন্য উত্তম ও সুন্দরতম জিহাদ হলো হজ্জ - মাব্রুম হজ।” আবু হুরাইরা রাদিয়াল্লাহু আনহু থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“বয়োবৃদ্ধ, অপ্রাপ্ত বয়স্ক, দুর্বল ও মহিলার জিহাদ হচ্ছে হজ ও উমরা |”\n" +
                    "8. হজ পাপ মোচন করে। আবু হুরায়রা রাদিয়াল্লাহু আনহু থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“যে আল্লাহর জন্য হজ করল, যৌন সম্পর্কযুক্ত অশ্লীল কাজ ও কথা থেকে বিরত থাকল এবং পাপ কাজ থেকে বিরত থাকল, সে তার মাতৃগর্ভ থেকে ভূমিষ্ঠ হওয়ার দিনের মতো পবিত্র হয়ে ফিরে এল ।”\n" +
                    "এ হাদীসের অর্থ আমর ইবনুল আস রাদিয়াল্লাহু আনহু থেকে বর্ণিত হাদীস দ্বারা আরো সুপ্রতিষ্ঠিত হয়, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বলেন,\n" +
                    "\n" +
                    "“তুমি কি জান না, “কারো ইসলাম গ্রহণ তার পূর্বের সকল গুনাহ বিলুপ্ত করে দেয়, হিজরত তার পূর্বের সকল গুনাহ বিলুপ্ত করে দেয় এবং হজ তার পূর্বের সকল গুনাহ বিলুপ্ত করে দেয়?”\n" +
                    "৫. হজের ন্যায় উমরাও পাপ মোচন করে। আবু হুরায়রা রাদিয়াল্লাহু আনহু থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“যে ব্যক্তি এই ঘরে এলো, অতঃপর যৌন সম্পর্কযুক্ত অশ্লীল কাজ ও কথা থেকে বিরত থাকল এবং পাপ কাজ থেকে বিরত থাকল, সে মায়ের গর্ভ থেকে ভূমিষ্ঠ হওয়ার দিনের মত (নিষ্পাপ) হয়ে ফিরে গেল।”\n" +
                    "ইমাম ইবন হাজার আসকালানীর মতানুসারে এখানে হজকারী ও উমরাকারী উভয় ব্যক্তিকেই বুঝানো হয়েছে।\n" +
                    "৬. হজ ও উমরা পাপ মোচনের পাশাপাশি হজকারী ও উমরাকারীর অভাব-অনটনও দূর করে দেয়। আবদুল্লাহ ইবন মাসউদ রাদিয়াল্লাহু ওয়াসাল্লাম বলেছেন,\n" +
                    "\n" +
                    "“তোমরা হজ ও উমরা পরপর করতে থাক, কেননা তা অভাব ও গুনাহ দূর করে দেয়।যেমন দূর করে দেয় কামারে হাপর লোহা, সোনা ও রুপার ময়লাকে।”\n" +
                    "\n" +
                    "৭. হজ ও উমরা পালনকারীগণ আল্লাহর মেহমান বা প্রতিনিধি। ইবন উমার রাদিয়াল্লাহু আনহুমা কর্তৃক বর্ণিত, রাসুলাল্লাহ সাল্লাল্লাহু  আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“আল্লাহর পথে যুদ্ধে বিজয়ী, হজকারী ও উমরাকারী আল্লাহর মেহমান বা প্রতিনিধি । আল্লাহ তাদেরকে আহবান করেছেন, তারা তাঁর ডাকে সাড়া দিয়েছেন। আর তারা তাঁর কাছে চেয়েছেন এবং তিনি তাদেরকে দিয়েছেন ।”\n" +
                    "অন্য হাদিসে আবু হুরায়রা রাদিয়াল্লাহু আনহু থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“হজ ও উমরা পালনকারিগণ আল্লাহর মেহমান বা প্রতিনিধি । তারা আল্লাহকে ডাকলে তিনি তাদের ডাকে সাড়া দেন। তারা তাঁর কাছে মাগফিরাত কামনা করলে তিনি তাদেরকে ক্ষমা করে দেন।”\n" +
                    "৮. এক উমরা থেকে আরেক উমরা- মধ্যবর্তী গুনাহ ও পাপের কাফফারা। আবু হুরায়রা রাদিয়াল্লাহু আনহু থেকে বর্ণিত সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন,\n" +
                    "\n" +
                    "\n" +
                    "“এক উমরা থেকে অন্য উমরা- এ দুয়ের মাঝে যা কিছু (পাপ) ঘটবে তা তার জন্য কাফফারা ।”\n" +
                    "৯. হজ করার নিয়তে বের হয়ে মারা গেলেও হজের সাওয়াব পেতে থাকবে । আবু হুরাইরা রাদিয়াল্লাহু আনহু থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন,\n" +
                    "\n" +
                    "“যে ব্যক্তি হজের উদ্দেশ্যে বের হয়েছে, অতপর সে মারা গেছে, তার জন্য কিয়ামত পর্যন্ত হজের নেকী লেখা হতে থাকবে । আর যে ব্যক্তি উমরার উদ্দেশ্যে বের হয়ে মারা যাবে, তার জন্য কেয়ামত পর্যন্ত উমরার নেকী লেখা হতে থাকবে ।”\n" +
                    "\n" +
                    "১০. আল্লাহ তা'আলা রমযান মাসে উমরা আদায়কে অনেক মর্যাদাশীল করেছেন। তিনি একে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে হজ করার সমতুল্য সাওয়াবে ভূষিত করেছেন। ইবন আব্বাস রাদিয়াল্লাহু আনহুমা থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“নিশ্চয় রমযানে উমরা করা হজ করার সমতুল্য অথবা তিনি বলেছেন, আমার সাথে হজ করার সমতুল্য”:\n" +
                    "১১. বাইতুল্লাহর উদ্দেশ্যে বের হলে প্রতি কদমে নেকী লেখা হয় ও গুনাহ মাফ করা হয় এবং তার মর্যাদা বৃদ্ধি করা হয়। আবদুল্লাহ ইবন  উমার রাদিয়াল্লাহু আনহুমা থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“তুমি যখন বাইতুল্লাহর উদ্দেশ্যে আপন ঘর থেকে বের হবে, তোমার বাহনের প্রত্যেকবার মাটিতে পা রাখা এবং পা তোলার বিনিময়ে তোমার জন্য একটি করে নেকী লেখা হবে এবং তোমার গুনাহ মাফ করা হবে।”\n" +
                    "আনাস ইবন মালেক রাদিয়াল্লাহু আনহু থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "\n" +
                    "“কারণ, যখন তুমি বাইতুল্লাহর উদ্দেশ্যে আপন ঘর থেকে বের হবে, তোমার উটনীর প্রত্যেকবার পায়ের ক্ষুর রাখা এবং ক্ষুর তোলার সাথে সাথে তোমার জন্য একটি করে নেকী লেখা হবে, তোমার একটি করে গুনাহ ক্ষমা করে দেওয়া হবে এবং তোমার মর্যাদা বৃদ্ধি করা হবে ।”\n" +
                    "স্মরণ রাখা দরকার, যে কেবল আল্লাহকে রাজী করার জন্য আমল করবে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুন্নাহ মোতাবেক হজ-উমরা সম্পন্ন করবে, সেই এসব ফযীলত অর্জন করবে। যেকোনো আমল আল্লাহর কাছে কবুল হওয়ার জন্য দু'টি শর্ত রয়েছে, যা অবশ্যই পূরণ করতে হবে।\n" +
                    "প্রথম শর্ত:\n" + " একমাত্র আল্লাহর সন্তুষ্টি লাভের জন্য করা। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“সকল কাজের ফলাফল নিয়তের ওপর নির্ভরশীল। প্রত্যেকে তাই পাবে, যা সে নিয়ত করবে।”\n" +
                    "দ্বিতীয় শর্ত:\n" + " রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুন্নাহ মোতাবেক হওয়া । কারণ, তিনি বলেছেন,\n" +
                    "“যে এমন আমল করল, যাতে আমাদের অনুমোদন নেই, তা প্রত্যাখ্যাত ।\"\n" +
                    "অতএব, যার আমল কেবল আল্লাহকে সন্তুষ্ট করার জন্য এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুন্নাহ মোতাবেক হবে তার আমলই আল্লাহর নিকট কবুল হবে। পক্ষান্তরে যার আমলে উভয় শর্ত অথবা এর যেকোনো একটি অনুপস্থিত থাকবে, তার আমল প্রত্যাখ্যাত হবে। তাদের আমল সম্পর্কে আল্লাহ বলেন,\n" +
                    "\n" +
                    "“আর তারা যে কাজ করেছে আমি সেদিকে অগ্রসর হব। অতঃপর তাকে বিক্ষিপ্ত ধূলিকণায় পরিণত করে দিব।” \n" +
                    "সুরা আল-ফুরকান,আয়াত: ২৩]\n" +
                    "পক্ষান্তরে যার আমলে উভয় শর্ত পূরণ হবে, তার আমল সম্পর্কে আল্লাহ বলেন,\n" +
                    "\n" +
                    "\n" +
                    "“আর দীনের ব্যাপারে তার তুলনায় কে উত্তম, যে সৎকর্মপরায়ণ অবস্থায় আল্লাহর কাছে নিজকে পূর্ণ সমর্পণ করল ।” [সুরা আন-নিসা,আয়াত: ১২৫]\n" +
                    "\n" +
                    "আল্লাহ আরো বলেন,\n" +
                    "\n" +
                    "\n" +
                    "“হাঁ, যে নিজকে আল্লাহর কাছে সোপর্দ করেছে এবং সে সৎকর্মশীলও, তবে তার জন্য রয়েছে তার রবের নিকট প্রতিদান। আর তাদের কোন ভয় নেই এবং তারা দুঃখিতও হবে না।” [সূরা আল-বাকারাহ, আয়াত: ১১২]\n" +
                    "\n" +
                    "সুতরাং উমার রাদিয়াল্লাহু আনহু বর্ণিত, “সকল কাজের ফলাফল নিয়তের উপর নির্ভরশীল” হাদিসটি অন্তরের আমলসমুহের মানদণ্ড  এবং আয়েশা রাদিয়াল্লাহু আনহা বর্ণিত “যে এমন আমল করল, যাতে আমার অনুমোদন নেই, তা প্রত্যাখ্যাত” হাদীসটি অঙ্গ-প্রত্যঙ্গের আমলসমূহের মানদণ্ড। হাদীস দুটি ব্যাপক অর্থবোধক । দীনের মূল বিষয়াদি ও শাখা-প্রশাখাসমূহ এবং অন্তর ও অঙ্গ-প্রত্যঙ্গের আমলের কোনোটিই এর বাইরে নয়। এক কথায় সম্পূর্ণ দীন এর আওতাভুক্ত।\n",


            " হজ তিনভাবে আদায় করা যায়: তামাত্তু, কিরান ও ইফরাদ।\n",


            "তামাত্তু হজের পরিচয়:\n" +
                    "হজের মাসগুলোতে হজের সফরে বের হবার পর প্রথমে শুধু উমরার ইহরাম বাঁধা এবং সাথে সাথে এ উমরার পরে হজের জন্য ইহরাম বাঁধার নিয়তও থাকা।\n" +
                    "\n" +
                    "তামাতু হজের নিয়ম:\n" +
                    "\n" +
                    "হাজী সাহেব হজের মাসগুলোতে প্রথমে শুধু উমরার জন্য তালবিয়া পাঠের মাধ্যমে ইহরাম বাঁধবেন। তারপর তাওয়াফ ও সা'ঈ সম্পন্ন করে মাথা মুণ্তন অথবা চুল ছোট করার মাধ্যমে উমরা থেকে হালাল হয়ে যাবেন এবং স্বাভাবিক কাপড় পরে নিবেন। তারপর যিলহজ মাসের আট তারিখ মিনা যাবার আগে নিজ অবস্থানস্থল থেকে হজের ইহরাম বাঁধবেন।\n" +
                    "\n" +
                    "তামাতু হজ তিনভাবে আদায় করা যায়\n" +
                    "\n" +
                    "ক) মীকাত থেকে উমরার ইহরাম বেঁধে মক্কায় গিয়ে তাওয়াফ-সা“ঈ করে মাথা মুন্ডন অথবা চুল ছোট করে হালাল হয়ে যাওয়া এবং হজ পর্যন্ত মক্কাতেই অবস্থান করা। ৮ যিলহজ হজের ইহরাম বেঁধে হজের কার্যক্রম সম্পন্ন করা।\n" +
                    "খ) মীকাত থেকে উমরার নিয়তে ইহরাম বেঁধে মক্কা গমন করা। উমরার কার্যক্রম তথা তাওয়াফ, সা'ঈ করার পর হলোক-কসর সম্পাদন করে হালাল হয়ে যাওয়া। হজের পূর্বেই যিয়ারতে মদীনা সেরে নেওয়া এবং মদীনা থেকে মক্কায় আসার পথে যুল-হুলাইফা বা আবইয়ারে আলী থেকে উমরার নিয়তে ইহরাম বেঁধে মন্কায় আসা। অতঃপর উমরা আদায় করে হলোক-কসর করে হালাল হয়ে যাওয়া, তারপর ৮ যিলহজ হজের জন্য নতুনভাবে ইহরাম বেঁধে হজ আদায় করা।\n" +
                    "গ) ইহরাম না বেঁধে সরাসরি মদীনা গমন করা। যিয়ারতে মদীনা শেষ করে মক্কায় আসার পথে যুল-হুলাইফা বা আবইয়ারে আলী থেকে উমরার নিয়তে ইহরাম বাঁধা অতপর মক্কায় এসে তাওয়াফ, সা'ঈ ও হলোক-কসর করে হালাল হয়ে যাওয়া। এরপর ৮ যিলহজ হজের ইহরাম বাঁধা।\n",


            " কিরান হজের পরিচয়:\n" +
                    "উমরার সাথে যুক্ত করে একই সফরে ও একই ইহরামে উমরা ও হজ আদায় করাকে কিরান হজ বলে।\n" +
                    "\n" +
                    "কিরান হজের নিয়ম: কিরান হজ দুইভাবে আদায় করা যায়।\n" +
                    "\n" +
                    "ক) মীকাত থেকে ইহরাম বাঁধার সময় একই সাথে হজ ও উমরার ইহরাম বাঁধার জন্য (লাববাইকা উমরাতান ওয়া হজ্জান) বলে তালবিয়া পাঠ শুরু করা। তারপর মক্কায় পৌছে প্রথমে উমরা আদায় করা এবং ইহরাম অবস্থায় মক্কায় অবস্থান করা। অতঃপর হজের সময় ৮ যিলহজ ইহরামসহ মিনা-'আরাফা-মুযদালিফায় গমন এবং হজের যাবতীয় কাজ সম্পাদন করা।\n" +
                    "খ) মীকাত থেকে শুধু উমরার নিয়তে ইহরাম বাঁধা। পবিত্র মক্কায় পৌঁছার পর উমরার তাওয়াফ শুরু করার পূর্বে হজের নিয়ত উমরার সাথে যুক্ত করে নেওয়া। উমরার তাওয়াফ-সা'ঈ শেষ করে ইহরাম অবস্থায় হজের অপেক্ষায় থাকা এবং ৮ যিলহজ ইহরামসহ মিনায় গমন ও পরবর্তী কার্যক্রম সম্পাদন করা।\n",


            " ইফরাদ হজের পরিচয়:\n" +
                    "হজের মাসগুলোতে শুধু হজের ইহরাম বেঁধে হজের কার্যক্রম সম্পন্ন করাকে ইফরাদ হজ বলে।\n" +
                    "ইফরাদ হজের নিয়ম:\n" +
                    "\n" +
                    "হজের মাসগুলোতে শুধু হজের ইহরাম বাঁধার জন্য (লাব্বাইকা হজ্জান) বলে তালবিয়া পাঠ শুরু করা। এরপর মক্কায় প্রবেশ করে তাওয়াফে কুদূম অর্থাৎ আগমনী তাওয়াফ এবং হজের জন্য সা'ঈ করা। অতঃপর ১০ যিলহজ কুরবানীর দিন হালাল হওয়ার পূর্ব পর্যন্ত ইহরাম অবস্থায় থাকা। এরপর হজের অবশিষ্ট কাজগুলো সম্পাদন করা। তাওয়াফে কুদূমের পর হজের সা'ঈকে তাওয়াফে ইফাযা অর্থাৎ ফরয তাওয়াফের পর পর্যন্ত বিলম্ব করা জায়েয আছে। ইহরামের সুন্নাতসমূহইহরাম বাঁধার পূর্বে নিচের বিষয়গুলো সুনাত:\n" +
                    "\n" +
                    "১. নখ কাটা, গোঁফ ছাঁটা, বগল ও নাভির নিচের চুল পরিষ্কার করা।\n" +
                    "রাসূলুল্লাল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "\n" +
                    "পাঁচটি জিনিস ফিতরাতের অংশ: খাতনা করা, ক্ষৌরকার্য করা, বগলের চুল উপড়ানো, নখ কাটা ও গোঁফ ছোট করা ।” ফিকহবিদগণ বলেছেন, এই আমলগুলো ইবাদতের মনোরম পরিবেশ তৈরিতে সহায়ক। আনাস রাদিয়াল্লাহু আনহু বলেন,\n" +
                    "\n" +
                    "“রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের জন্য গোঁফ ছোট উপড়ানোর সর্বোচ্চ সময় নির্ধারণ করে দিয়েছেন। আমরা যেন চল্লিশ দিনের বেশি এসব কাজ ফেলে না রাখি ।”\n" +
                    "মাথার চুল ছোট না করে যেভাবে আছে সেভাবেই রেখে দিন। কেননা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও সাহাবায়ে কিরাম ইহরামের পূর্বে মাথার চুল কেটেছেন বা মাথা মুণ্ডন করেছেন বলে কোনো বর্ণনায় পাওয়া যায় না।\n" +
                    "উল্লেখ্য, ইহরামের আগে বা পরে কখনো দাড়ি কামানো যাবে না। কেননা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“তোমরা মুশরিকদের বিরুদ্ধাচারণ করো। দাড়ি লম্বা করো এবং গোঁফ ছোট করো।”\n" +
                    "২. গোসল করা। যায়েদ ইবন সাবিত রাদিয়াল্লাহু আনহু থেকে বর্ণিত,\n" +
                    "\n" +
                    "“তিনি দেখেছেন যে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহরামের জন্য সেলাইযুক্ত কাপড় পাল্টিয়েছেন এবং গোসল করেছেন।”\n" +
                    "এই গোসল পুরুষ ও মহিলা উভয়ের জন্য, এমনকি নিফাস ও হায়েষবতীর জন্যও সুনাত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসমা বিন্ত উমাইস রাদিয়াল্লাহ আনহু কে জুল-হুলায়ফায় সন্তান প্রসবের পর বলেন\n" +
                    "\n" +
                    "“তুমি গোসল কর, কাপড় দিয়ে পট্টি বাঁধ এবং ইহরাম বাঁধো । গোসল করা সম্ভব না হলে অযু করা। অযু-গোসল কোনোটাই যদি করার সুযোগ না থাকে তাহলেও কোন সমস্যা নেই। এ ক্ষেত্রে তায়াম্মুম করতে হবে না। কেননা গোসলের উদ্দেশ্য হচ্ছে, পরিচ্ছন্নতা অর্জন ও দুর্গন্ধযুক্ত হওয়া। তায়াম্মুম দ্বারা এই উদ্দেশ্য হাসিল হয় না।\n" +
                    "\n" +
                    "\n" +
                    "৩. ইহরাম বাঁধার পূর্বে শরীরে, মাথায় ও দাড়িতে উত্তম সুগন্ধি ব্যবহার করা। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহরাম বাঁধার পূর্বে সুগন্ধি ব্যবহার করেছেন। আয়েশা রাদিয়াল্লাহু আনহার হাদীসে এসেছে,\n" +
                    "\n" +
                    "“আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে তাঁর ইহরাম বাঁধার পূর্বে এবং কুরবানীর দিন বাইতুল্লাহর তাওয়াফের পূর্বে মিশকযুক্ত সুগন্ধি লাগিয়ে দিতাম ।”\n" +
                    "আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুগন্ধি তাঁর মাথা ও দাঁড়িতে অবশিষ্ট থাকতো যেমনটি অনুমিত হয় আয়েশা রাদিয়াল্লাহু আনহার উক্তি থেকে। তিনি বলেন,\n" +
                    "\n" +
                    "\n" +
                    "“আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাঁর কাছে থাকা উত্তম সুগন্ধি লাগিয়ে দিতাম এমনকি আমি তাঁর মাথা ও দাড়িতে সুগন্ধির চকচকে ভাব দেখতে পেতাম ।” তিনি আরো বলেন,\n" +
                    "\n" +
                    "আমি যেন মুহরিম অবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সিথিতে মিশকযুক্ত সুগন্ধির চকচকে ভাব লক্ষ্য করছি।”\n" +
                    "লক্ষণীয়, ইহরাম বাঁধার পর শরীরের কোনো অংশে সুগন্ধির প্রভাব রয়ে গেলে তাতে কোনো সমস্যা নেই। তবে ইহরামের কাপড়ে সুগন্ধি ব্যবহার করা কোনোভাবেই জায়েয নয়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরিমকে সুগন্ধিযুক্ত কাপড় পরিধান পরিহার করতে বলেছেন। তাঁকে জিজ্ঞাসা করা হলো, “ইহরাম অবস্থায় কাপড় পরতে আমাদের কী করণীয়? উত্তরে তিনি বলেন, “তোমরা জাফরান এবং ওয়ারস (এক প্রকার সুগন্ধি) লাগানো কাপড় পরিধান করো না।”\n" +
                    "৪. সেলাইবিহীন সাদা লুঙ্গি ও সাদা চাদর পরা এবং এক জোড়া জুতো বা স্যান্ডেল পায়ে দেওয়া। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,\n" +
                    "\n" +
                    "“তোমাদের প্রত্যেকে যেন একটি লুঙ্গি, একটি চাদর এবং এক জোড়া চপ্পল পরিধান করে ইহরাম বাঁধে ।”\n" +
                    "সাদা কাপড় পুরুষের সর্বোত্তম পোশাক। তাই পুরুষের ইহরামের জন্য সাদা কাপড়ের কথা বলা হয়েছে। ইহরামের ক্ষেত্রে মহিলার আলাদা কোন পোশাক নেই। শালীন ও টিলে-ঢালা, পর্দা বজায় থাকে এ ধরনের যেকোনো পোশাক পরে মহিলা ইহরাম বাঁধতে পারে। ইহরাম অবস্থায় সেলাইযুক্ত কাপড় পরা ও মাথা আবৃত করা পুরুষের জন্য নিষিদ্ধ হলেও মহিলার জন্য নিষিদ্ধ নয়।\n" +
                    "তবে ইহরাম অবস্থায় নিকাব বা অনুরূপ কোন পোশাক দিয়ে সর্বক্ষণ চেহারা ঢেকে রাখা বৈধ নয়। হাদীসে এসেছে, “মহিলা যেন নেকাব না লাগায় ও হাতমোজা না পরে ।” তবে এর অর্থ এ নয় যে, বেগানা পুরুষের সামনেও মহিলা তার চেহারা খোলা রাখবে । এ ক্ষেত্রে আলিমগণ একমত্য পোষণ করেছেন যে, মাথার ওপর থেকে চাদর ঝুলিয়ে দিয়ে চেহারা ঢেকে মহিলাগণ বেগানা পুরুষ থেকে পর্দা করবে।\n" +
                    "\n" +
                    "৫. সালাতের পর ইহরাম বাঁধা। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতের পর ইহরাম বেঁধেছেন। জাবির রাদিয়াল্লাহু আনহু বলেন,  “রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদে সালাত আদায় করে উটের পিঠে আরোহণ করলেন এবং তাওহীদের বাণী:\n" +
                    "\n" +
                    "(লাব্বাইক আল্লাহুম্মা লাব্বাইক লা শারীকা লাকা লাব্বাইক) বলে ইহরাম বাঁধলেন”\n" +
                    "ইবনে উমার রাদিয়াল্লাহু আনহুমা বলেন, “রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুল-হুলাইফাতে দুই রাকাত সালাত আদায় করেন। এরপর উটটি যখন তাঁকে নিয়ে যুল-হুলাইফার মসজিদের পাশে সোজা হয়ে দাঁড়াল, তখন তিনি সেই কালেমাগুলো উচ্চারণ করে ইহরাম বাঁধলেন ।”\n" +
                    "\n" +
                    "উমার রাদিয়াল্লাহু আনহুমা বলেন, “রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আকীক উপত্যকায় বলতে শুনেছি,\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "“আমার রবের পক্ষ থেকে একজন আগন্তক রাতের বেলায় আমার কাছে এসে বলল, এই বরকতময় উপত্যকায় সালাত আদায় করুন এবং বলুন, একটি হজের মধ্যে একটি উমরা ।”\n" +
                    "\n" +
                    "এসব হাদীসের আলোকে একদল আলিম বলেন, ইহরাম বাঁধার পূর্বে দুই রাকাত ইহরামের সালাত আদায় করা সুননাত। আরেকদল “আলিমের মতে ইহরামের জন্য কোনো বিশেষ সালাত নেই। তারা বলেছেন, ইহরাম বাঁধার সময় যদি ফরয সালাতের ওয়াক্ত হয়ে যায়, তাহলে হজ ও উমরা করতে ইচ্ছুক ব্যক্তির জন্য ফরয সালাত আদায়ের পর ইহরাম বাঁধা উত্তম। অন্যথায় সালাত ছাড়াই ইহরাম বাঁধবে। কেননা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরয সালাতের পর ইহরাম বেঁধেছিলেন। আর তাঁর সালাতে এমন কোনো লক্ষণ ছিল না, যা ইহরামের বিশেষ সালাতের প্রতি ইঙ্গিত বহন করে।\n" +
                    "তবে সঠিক কথা হচ্ছে, ইহরামের জন্য সুনির্দিষ্ট কোনো সালাত নেই। তাই ইহরাম বাঁধার সময় যদি ফরয সালাতের ওয়াক্ত হয়ে যায়, তাহলে ফরয সালাত আদায়ের পর ইহরাম বাঁধবে । অন্যথায় সম্ভব হলে তাহিয়্যাতুল অযু হিসেবে দুই রাকাত সালাত পড়ে ইহরামে প্রবেশ করবে।\n" +
                    "৬. তালবিয়ার শব্দগুলো বেশি বেশি উচ্চারণ করা। কেননা তালবিয়া হজের শ্লোগান। তালবিয়া যত বেশি পাঠ করা যাবে, তত বেশি সাওয়াব অর্জিত হবে।\n",


            " বেসরকারি ব্যবস্থাপনায় হজযাত্রীদের হজ সংশ্লিষ্ট আর্থিক লেনদেনের পূর্বে এজেন্সি কর্তৃক প্রদেয় সুযোগ-সুবিধার বিষয়ে ভালভাবে অবগত হতে হবে। www.hajj.gov.bd ওয়েবসাইটে প্রকাশিত ফরম নং-১৫ পূরণ করে চুক্তি সম্পাদন পূর্বক নিজের কাছে সংরক্ষণ করতে হবে।\n" +
                    "সরকার অনুমোদিত হজ এজেন্সির সাথে সরাসরি হজ সংশ্লিষ্ট আর্থিক লেনদেন করুন।\n" +
                    "বেসরকারি ব্যবস্থাপনার হজযাত্রীগণ চুক্তি মোতাবেক প্রদেয় অর্থ সরাসরি হজ এজেন্সির ব্যাংক একাউন্টে জমা দিয়ে অবশ্যই প্রাক-নিবন্ধন ও নিবন্ধন সনদ সংগ্রহ ও সংরক্ষণ করবেন।\n" +
                    "প্রত্যেক হজযাত্রী নিবন্ধন সনদ পাওয়ার পর সংশ্লিষ্ট এজেন্সির সাথে যোগাযোগ করে বিমানের টিকেট প্রাপ্তি নিশ্চিত করবেন।\n" +
                    "বিমান টিকেটের বিষয়ে নিশ্চিত হয়ে বাড়ী থেকে হজের উদ্দেশ্যে বের হবেন\n" +
                    "মধ্যস্বত্ত্বভোগী কোন ব্যক্তি/কাফেলা/দালাল/প্রতিনিধির সাথে হজ সংশ্লিষ্ট আর্থিক লেনদেন থেকে বিরত থাকুন।\n" +
                    "তথাকথিত কোন কাফেলা/গ্রুপ লিডার/দালাল/মধ্যস্বত্ত্বভোগী ব্যক্তির সাথে হজের লেনদেন করে প্রতারিত হলে হজযাত্রীকে উক্ত দায় বহন করতে হবে।\n" +
                    "হজ গমনের পূর্বে প্রত্যেক হজযাত্রী তাঁর পাসপোর্টের সাথে মক্কা ও মদিনায় তাঁর জন্য ভাড়াকৃত বাড়ি/ হোটেলের স্টিকার সংযুক্ত রয়েছে কিনা তা নিশ্চিত হতে হবে। \n" +
                    "বেসরকারি ব্যবস্থাপনার সম্মানিত হজযাত্রীগণ হাব কর্তৃক নির্ধারিত সর্বনিম্ন প্যাকেজ মূল্যে এজেন্সির সাথে চুক্তিবদ্ধ হবেন। \n" +
                    "হজযাত্রী হারানো প্রসঙ্গেঃ হজযাত্রীগণকে তাঁর হজের আইডি কার্ড সবসময় গলায় ঝুলিয়ে রাখার জন্য অনুরোধ করা হল। কেউ হারানো গেলে আতংকিত না হয়ে হজ আইডি কার্ডটি নিকটস্থ কোন স্বেচ্ছাসেবককে প্রদর্শন করলে সেই স্বেচ্ছাসেবক তাকে মক্কাস্থ বাংলাদেশ হজ মিশনে পাঠানোর ব্যবস্থা করবে।\n" +
                    "হজযাত্রীগণ নিজের ইচ্ছামত হজযাত্রার তারিখ ও ফিরতি তারিখ নির্ধারণ না করাঃ যেহেতু হজযাত্রা একটি গ্রুপভিত্তিক মুভমেন্ট এবং ২টি রাষ্ট্রের বহুবিধ নিয়ম-কানুন মেনে হজব্রত পালন করতে হয়, তাই নিজের ইচ্ছা মাফিক তারিখ নির্ধারন না করে গ্রুপের বেধে দেয়া তারিখের সাথে নিজে খাপ খাওয়ানোর চেষ্টা করা উচিৎ। \n" +
                    "হজ এজেন্সির সাথে সরাসরি হজের অর্থের লেনদেন করুন। প্রতারনার বিষয়ে সাবধান থাকুন। আপনার হজে গমন নিরাপদ ও নিশ্চিত করুন।\n" +
                    "ধর্ম বিষয়ক মন্ত্রণালয় কর্তৃক প্রকাশিত “হজ প্যাকেজ” ও “প্রত্যেক হজযাত্রীর জন্য জরুরি অনুসরণীয় বিষয়সমূহ” নামক পুস্তিকাদ্বয় সংগ্রহ করে আপনার যাবতীয় করনীয় সম্পর্কে ভালভাবে জেনে নিন। \n",


            " নিবন্ধনকারী হজ এজেন্সি তার নিবন্ধিত সকল হজযাত্রীকে সৌদি আরবে প্রেরণসহ যাবতীয় দায়-দায়িত্ব সরাসরি পালন করবেন। \n" +
                    "হজযাত্রীর পাসপোর্টে তাঁর জাতীয় পরিচয়পত্রের নম্বরটি সঠিকভাবে উল্লেখ রয়েছে কিনা তা নিশ্চিত করতে হবে।\n" +
                    "ধর্ম বিষয়ক মন্ত্রণালয় কর্তৃক প্রকাশিত “হজ প্যাকেজ” ও “প্রত্যেক হজযাত্রীর জন্য জরুরি অনুসরণীয় বিষয়সমূহ” নামক পুস্তিকাদ্বয় সংগ্রহ করে আপনার যাবতীয় করনীয় সম্পর্কে ভালভাবে জেনে নিন। \n" +
                    "হাব কর্তৃক নির্ধারিত সর্বনিম্ন প্যাকেজ মূল্যের নিম্নে কোন হজ এজেন্সি যেন হজে গমণ করতে হজযাত্রীর সাথে চুক্তি না করেন। \n" +
                    "হজ গমন বিষয়ে হালনাগাদ তথ্য পেতে নিয়মিত www.hajj.gov.bd ওয়েবসাইটে ব্রাউজ করুন। \n",


            " নিজের দায়িত্বের আধীন সকল হাজী সাহেবদের ফোন নম্বরসহ ঠিকানা সংগ্রহ করে কাগজপত্র বুঝিয়ে দেওয়া এবং সময় মত হজ ক্যাম্পে হাজির করা।\n" +
                    "হজ ক্যাম্পে, ব্যাংকে ও বিমান বন্দরের আনুষ্ঠানিকতা সম্পন্ন করতে সহযোগিতা করা। \n" +
                    "তালবিয়া অনেকেরই মুখস্ত নেই। তাই সময় নিয়ে সব হাজীকে তালবিয়ার সহিহ-শুদ্ধ মশকের ব্যবস্থা করবেন। \n" +
                    "সর্বদা হাজী সাহেবদের খোঁজ-খবর রাখবেন। কেউ অসুস্থ হলে বাংলাদেশ হজ মিশনের চিকিৎসা কেন্দ্রে নিয়ে আসবেন। সাধারণ অসুখ হলে সঙ্গে থাকা ওষুধ পথ্যও  খাইয়ে দেখতে পারেন। জটিল রোগ দেখা দিলে বা এক্সিডেন্ট করলে স্থানীয় লোকদের সাথে বা বাড়ির হারেস এর সাথে কথা বলে হসপিটালে নিয়ে যাবেন। \n" +
                    "হজের ৫দিন প্রতিটি প্রোগ্রাম আগেই হাজীদের সাথে আলোচনা করে কখন, কিভাবে কী করা হবে তা ঠিক করে নিবেন। সবাই মাশওয়ারার মাধ্যমে কাজগুলি করবেন। এক সাথে খাকার চেষ্টা করবেন। \n" +
                    "মিনার তাবু নম্বর,  ব্লক নম্বর, গেট নম্বর এরিয়ার পরিচিতিমূলক কোন নিদর্শন সবাইকে বুঝিয়ে বা লিখে বের হতে দিবেন। এখানে হারালে ফিরে আসা একটু কঠিন। এক্ষেত্রে ধর্ম  বিষয়ক মন্ত্রণালয় কর্তৃক প্রকাশিত মিনার ম্যাপ ব্যবহার করুন।   \n",


            " বাংলাদেশের হজযাত্রীগণের স্বাস্থ্য সেবা দুই পর্বে দেয়া হয়ে থাকে।\n\n স্বাস্থ্য পরীক্ষা  ও টিকাদানের মাধ্যমে  জেলা পর্যায় হতে  এই কার্যক্রম  বাংলাদেশে শুরু হয় এবং আশকোনাস্থ হজ ক্যাম্প,\n\n বিমানবন্দর হয়ে সৌদি আরবের বিভিন্ন নগরীতে (মক্কা, মদিনা ও জেদ্দা )  হজ্জব্রত পালনকালে পুরো সময় জুড়ে দেয়া হয়।\n",


            "(ক)বাংলাদেশে হজযাত্রীদের স্বাস্থ্য সেবা:\n স্বাস্থ্য ও পরিবার কল্যাণ মন্ত্রণালয় এর তত্বাবধানে স্বাস্থ্য অধিদপ্তরের রোগ নিয়ন্ত্রণ শাখা, জেলা ও উপজেলা পর্যায়ে এবং ঢাকা মহানগরীতে মেডিকেল বোর্ড গঠন করত হজযাত্রীদের স্বাস্থ্য পরীক্ষা করে ভ্যাকসিন প্রদান পূর্বক স্বাস্থ্য সনদ পত্র প্রদান করে থাকে। এছাড়াও হজ ক্যাম্পে অবস্থান কালে অসুস্থ হজ যাত্রীদের রোগ সনাক্তকরন ও চিকিৎসা প্রদান করা হয়।\n" +
                    "(খ) সৌদি আরবে হজযাত্রীদের স্বাস্থ্য সেবা:\n হজ্জব্রত পালনকারীদের সৌদি আরবে গমনের পর থেকে স্বদেশ প্রত্যাবর্তন পর্যন্ত ধর্ম বিষয়ক  মন্ত্রণালয়,সামরিক স্বাস্থ্য পরিদপ্তর এবং স্বাস্থ্য ও পরিবার কল্যাণ মন্ত্রণালয়  যৌথভাবে স্বাস্থ্য সেবা নিশ্চিত করে থাকে।  মক্কা শরীফ , মদিনাশরীফ ও সীমিত ক্ষেত্রে জেদ্দা অবস্থান কালে এই সেবা প্রদান করতে হয়।\n" +
                    "\n" +
                    "যেসব চিকিৎসা সেবা দেয়া হয়:\n" +
                    " ** হঠাৎ করে অসুস্থ হওয়া বা আহত রোগীদের জরুরী চিকিৎসা\n" +
                    " ** দীর্ঘমেয়াদী রোগে আক্রান্ত  যেমন ডায়াবেটিস, উচ্চ রক্তচাপ, হৃদরোগ, হাঁপানী ইত্যাদি রোগীদের ব্যবস্থাপনা\n" +
                    " ** মহিলা হজযাত্রীদের ঋতুস্রাব নিয়ন্ত্রনের জন্য চিকিৎসা\n" +
                    " ** প্রয়োজনে সাময়িক অন্ত:বিভাগ সেবা প্রদান\n" +
                    " ** নির্দিষ্ট শারীরিক ও ল্যাবরেটরী পরীক্ষা\n" +
                    " ** ছোট খাট অপারেশন এবং চিকিৎসা পরামর্শ ও মনোচিকিৎসা\n" +
                    " ** গুরুতর অসুস্থ রোগীদের উন্নত চিকিৎসার জন্য নির্দিষ্ট বিশেষায়িত হাসপাতালে প্রেরন\n" +
                    " ** হজ শেষে হাসপাতাল থেকে ছাড়কৃত অসুস্থ রোগীদের বাংলাদেশে প্রেরনের প্রয়োজনীয় ব্যবস্থা গ্রহন\n" +
                    " ** বাংলাদেশের স্বাস্থ্য সেবা কেন্দ্র কিংবা হজযাত্রীদের বাসস্থানে মৃত্যুবরনকারীদের মৃত্যুর সনদ প্রদান।\n",


            " ** হজের সময় মক্কা, মদীনা ও জেদ্দায় অনেক লোক সমাগম হয়। যেখানেই লোক সমাগম বেশী হয় সেখানেই বায়ুবাহী রোগের প্রাদুর্ভাব দেখা দিতে পারে। নিউমোনিয়া, মেনিনজাইটিস, ইত্যাদি বায়ুবাহী রোগ কখনো কখনো জীবনঘাতী হতে পারে। এ থেকে নিরাপদ থাকার জন্য রাস্তায় চলাকালে ফেসমাস্ক ব্যবহার করুন। মক্কায় দিনের বেলায় তাপমাত্রা ৪৮ ডিগ্রীরও বেশী থাকে তাই রোদে ঘোরা ফেরা যথাসম্ভব পরিহার করুন। রোদে বের হতে হলে অবশ্যই সাদা ছাতা ব্যবহার করুন।\n\n" +
                    " ** মক্কায় দিনের বেলায় রোদে চলা ফেরার পর পিপাসা মেটানোর জন্য খুব ঠান্ডা পানি খাওয়া/শরীরে ঢালা যাবে না ।এতে গলা বসে যেতে পারে এবং যাদের কোল্ড এলার্জি আছে তাদের শারীরিক সমস্যা দেখা দিতে পারে। \n\n" +
                    " ** গরমে থাকার পর ঘামে ভিজে যাওয়া জামা কাপড় নিয়ে তাৎক্ষনিক এসির ঠান্ডায় বসবেননা,কারণ ঘাম শুকিয়ে ঠান্ডা লেগে যেতেপারে। সুতির টাওয়েল দিয়ে ঘাম শুকিয়ে ফেললে ঠন্ডিা লাগা এড়ানো যেতে পারে।\n" +
                    " ** খালি পায়ে রাস্তায় চলা কোন ভাবেই উচিৎ নয়। রোদের তাপে প্রচন্ড উত্তপ্ত রাস্তার পিচের গরমে পায়ের তলার চামড়া পুড়ে যেতে পারে এ অবস্থায় সমগ্র হজ জুড়ে হুইল চেয়ারে চড়া ছাড়া আর কোন উপায় থাকবে না।\n" +
                    " ** প্রচুর পরিমানে পানি/ তরল খাবার/ ফলের রস/ সরবৎ পান করুন। তবে ডায়াবেটিসের রোগী গণ বাংলাদেশে যেভাবে খাদ্যাভ্যাসনিয়ন্ত্রণ করতেন সেভাবে সৌদি আরবেও করতে হবে। \n\n মিষ্টি, খেজুর, মিষ্টি ফলের রস, মিষ্টি শরবৎ ইত্যাদি পানকরলে রক্তের গ্লুকোজের মাত্রা বেড়ে যেতে পারে।রক্তের সুগার পরীক্ষা করে ডায়াবেটিসের ঔষধ নিয়মিত সেবন করবেন। এক্ষেত্রে কোন কুসংস্কারে কান দেবেন না। মনে রাখবেন খেজুর যেখানেরই হোক না কেন তা ডায়াবেটিক রোগীদের জন্য ক্ষতিকর।\n" +
                    " ** আদ্রতা কম থাকার কারনে ত্বকে চুলকানি হতে পারে এবং পায়ের গোড়ালির চামড়ায় ফাটল  ধরতে পারে। এভাবে ফাটল ধরলে তাহতে রক্তক্ষরণ হয়ে জীবানু সংক্রমণ হতে পারে। এ অবস্থা থেকে মুক্তি পেতে গোসল ও ওযুর পর চামড়া ভেজা ও নরম অবস্থায় ত্বকে পরিমিতভাবে ভ্যাসলিন (পেট্রোলিয়াম জেলী) ব্যবহার করুন।\n" +
                    " ** ডায়রিয়ায় আক্রান্ত হলে প্রতিবার পায়খানার পর  এক গ্লাস ওরালস্যালাইন খাবেন, যত দ্রুত সম্ভব বাংলাদেশ মেডিক্যাল সেন্টারে যোগাযোগ করে ডাক্তারের  পরামর্শ নেবেন।\n" +
                    " ** ৩ ঘন্টার বেশী সময় ধরে যথাযথভাবে সংরক্ষন করা হয়নি এ ধরনের বাসী খাবার খাবেন না। অধিক গরমের কারণে খাবারে রোগ জীবানু জন্মাতে পারে। অতিরিক্ত চর্বি/তেল জাতীয় খাবার পরিহার করুন। আঁশযুক্ত শাকসবজী ফলমূল বেশী করে খাবার অভ্যাস করুন।\n" +
                    " ** পানির ট্যাপ খুলে পানি ব্যবহারের আগে পানির তাপমাত্রা হাত দিয়ে  পরীক্ষা করে নেবেন। ওয়াটার হিটার ভুলক্রমে চালু থাকলে উত্তপ্ত পানিট্যাপ থেকে বের হতে পারে এবং উত্তপ্ত পানিতে হাত লাগলে হাত পুড়ে যেতে পারে।\n" +
                    " ** কারো জলবসন্ত, হাম ইত্যাদি সংক্রামক রোগ দেখা দিলে তাৎক্ষনিকভাবে তাকে মেডিক্যাল সেন্টারে নিয়ে আসতে হবে। কোন অবস্থায়ই কোন সংক্রামক রোগীকে বাসায় অন্যান্য হাজীগণের সাথে রাখা যাবে না। এটা বিপুল সংখ্যক লোকের জন্য বিপদের কারণ হতে পারে।\n" +
                    " ** একজনের ব্যবহৃত ব্লেড, রেজার, টুথপিক, ডেন্টাল ফ্লস অন্য কেউ ব্যবহার করবেন না। এসব ব্যবহারের মাধ্যমে মারাত্মক জীবনঘাতী রোগ আপনার দেহে সংক্রমিত হতে পারে।\n" +
                    " ** মুজদালিফায় সাধারণত: অনেক হাজীকে একটি টয়লেট ব্যবহারের জন্য অপেক্ষা করতে হয়। কারণ হাজীর সংখ্যার অনুপাতে টয়লেটের সংখ্যা অপ্রতুল। তাই আরাফার দিনে যথাসম্ভব তরল খাবার/পানীয় খেলে টয়লেটে যাবার প্রয়োজন খুব বেশী অনুভূত হবেনা। টয়লেটের জন্য লাইনে দাড়িয়ে অপেক্ষা করার চেয়ে অপেক্ষাকৃত হালকা ও তরল খাবার খেয়ে স্বস্তিতে থাকা শ্রেয়।\n" +
                    " ** আরাফার দিন ৯ ই জিলহজ তারিখে প্রচন্ড রোদে বাইরে ঘোরাফেরা না করে নিজ নিজ তাবুতে বসেই ইবাদত বন্দেগীতে নিয়োজিত থাকা উত্তম। রোদের তীব্রতার মধ্যে জাবালে রহমতে উঠতে গেলে হিট স্ট্রোকে আক্রান্ত হওয়ার সম্ভাবনা থাকে। \n" +
                    " ** বাংলাদেশ থেকে আগত হজ চিকিৎসক দলের সদস্য সার্বক্ষণিক হাজী সেবায় নিয়োজিত রয়েছে। নিজ নিজ বাসস্থানে কোন সমস্যায় পড়লে আইডি কার্ডের পেছনে উল্লেখিত নম্বরে ফোন করলে যথাসম্ভব দ্রুত সমাধানের উদ্যোগ গ্রহণ করা হবে। বাংলাদেশ হজ মিশন হজযাত্রীদের সার্বক্ষণিক সেবায় নিয়োজিত। \n",


    };

    String[] str3 = {"১. তামাত্তু হজ\n",

    };
    String[] str4 = {

    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_details);

        t1 = findViewById(R.id.textView_id);
        t2 = findViewById(R.id.textView_two_id);
        Intent i = getIntent();
        String s = i.getStringExtra("pos");//t1.setText(s);
        int position = Integer.parseInt(s);

        t1.setText(str_title[position]);
        t2.setText(str1[position]);


    }
}
/*
 if (position == 0) {
            t1.setText(str_title[0]);
            t2.setText(str1[0]);
        } else if (position == 1) {
            t1.setText(str_title[1]);
            t2.setText(str1[1]);
        } else if (position == 2) {
            t1.setText(str_title[2]);
            t2.setText(str1[2]);
        } else if (position == 3) {
            t1.setText(str_title[3]);
            t2.setText(str1[3]);
        } else if (position == 4) {
            t1.setText(str_title[4]);
            t2.setText(str1[4]);
        } else if (position == 5) {
            t1.setText(str_title[5]);
            t2.setText(str1[5]);
        }
        else if (position == 6) {
            t1.setText(str_title[6]);
            t2.setText(str1[6]);
        } else if (position == 7) {
            t1.setText(str_title[7]);
            t2.setText(str1[7]);
        } else if (position == 8) {
            t1.setText(str_title[8]);
            t2.setText(str1[8]);
        }
        else if (position == 9) {
            t1.setText(str_title[9]);
            t2.setText(str1[9]);
        }
 */

